token = ""

dangertext = ['porn', 'порн', 'sex', 'секс', 'еба', 'ёба', 'ебл', 'ёбл', 'хент', 'hent', 'сука', 'пидор', 'хуй', 'бля', 'хер', 'уёб', 'уеб', 'гандон', 'гондон', 'залупа', 'еба', 'еьа', 'аху', 'пиз', 'ниху', 'нихе', 'неху', 'нехе', 'хуя', 'хуи', 'хуё', 'е6', 'хуе', 'xуе', 'xуё', 'xуи', 'xуя', 'неxе', 'нeхe', 'нexe', '6ля', 'p0rn', 'п0рн', 'голы', 'гола', 'ххх', 'xxx', 'трах', 'trah', 'gay', 'гей', 'rule34', 'rule 34', 'r34', 'r 34', 'правило34', 'правило 34', 'непристойн', 'даун', 'россия', 'украина', 'укр', 'рос', 'украiна', 'Хохол', 'гитлер', 'русия', 'русские', 'украинцы', 'мертвые', 'трупы', 'негр', 'профиль', 'рассия', 'украïна', 'украïнi', 'россiя', 'русня', 'беру в рот', 'даю в попу']
accept = ["хероку"]
dangerstickers = ["AgADoxgAAu9lgEk", "AgADwhcAAmsgUEg", "AgAD6BYAAj3ScUg"]

nums2ban = "3"
